config/InformationRegisters/DWH_ОбменСменыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>DWH_ОбменСменыККМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СменаККМ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_СменаККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/InformationRegisters/DWH_ДатыДвиженийДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>DWH_ДатыДвиженийДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТовара</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_АрбитражИзъятие</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Трансформация</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаРозничныхЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РеализацияККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Торг2</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Списание</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеЗаказов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаПоКачеству</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ВозвратТовара</v8:Type>
						<v8:Type>cfg:DocumentRef.РА_РекламнаяАкция</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУчетнойПолитики</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Разбраковка</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_КорректировкаНедовоза</v8:Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_МелкооптоваяРеализация</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РаспоряжениеМОР</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПоступлениеТовара</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_АрбитражПомещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/CommonModules/DWH_Обмен/Ext/Module.bsl
Процедура ЗаписатьИзменение(Ссылка)
	
	МЗ = РегистрыСведений.DWH_ОбменСменыККМ.СоздатьМенеджерЗаписи();
	МЗ.СменаККМ = Ссылка;
	МЗ.Прочитать();
	МЗ.СменаККМ = Ссылка;
	МЗ.ДатаЗаписи = ТекущаяДата();
	МЗ.Индекс = МЗ.Индекс + 1;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура ЗафиксироватьИзмененияВДвижениях(Ссылка, ТипЗнчСсылка)
	
	ТипДокумента = 0;
	Если ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_ПоступлениеТовара") Тогда
		ТипДокумента = 201
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Торг2") Тогда
		ТипДокумента = 202
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_ВозвратОтПокупателя") Тогда
		ТипДокумента = 204
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Перемещение") Тогда
		ТипДокумента = 205
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_ВозвратТовара") Тогда
		ТипДокумента = 209
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_МелкооптоваяРеализация") Тогда
		ТипДокумента = 211
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Списание") Тогда
		ТипДокумента = 212
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Инвентаризация") Тогда
		ТипДокумента = 215
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Разбраковка") Тогда
		ТипДокумента = 216
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_КорректировкаНедовоза") Тогда
		ТипДокумента = 217
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_РеализацияККМ") Тогда
		ТипДокумента = 300
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.Инвойс") Тогда
		ТипДокумента = 400
	// Остальных типов нет(или не нашел) придумаем сами	
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_ВводОстатков") Тогда
		ТипДокумента = 301
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Списание") Тогда
		ТипДокумента = 302
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_АрбитражПомещение") Тогда
		ТипДокумента = 303
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_АрбитражИзъятие") Тогда
		ТипДокумента = 304
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.ИзменениеУчетнойПолитики") Тогда
		ТипДокумента = 305
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.ПереоценкаПоКачеству") Тогда
		ТипДокумента = 306
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_Трансформация") Тогда
		ТипДокумента = 307
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_РаспоряжениеМОР") Тогда
		ТипДокумента = 308
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.Заказ") Тогда
		ТипДокумента = 309
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.ЗакрытиеЗаказов") Тогда
		ТипДокумента = 310
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.ПоступлениеТовара") Тогда
		ТипДокумента = 311
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.РА_РекламнаяАкция") Тогда
		ТипДокумента = 312
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ТипДокумента = 313
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.ИнтернетЗаказ") Тогда
		ТипДокумента = 314
	//+++ Самсонов ENT-345 
	ИначеЕсли ТипЗнчСсылка = Тип("ДокументСсылка.УстановкаРозничныхЦен") Тогда
		ТипДокумента = 315
	КонецЕсли; 
	//---
	
	МЗ = РегистрыСведений.DWH_ДатыДвиженийДокументов.СоздатьМенеджерЗаписи();
	МЗ.ДокументСсылка = Ссылка;
	МЗ.Прочитать();
	
	МЗ.ТипДокумента = ТипДокумента;
	МЗ.ДатаИзменения = ТекущаяДата();
	МЗ.ДокументСсылка = Ссылка;
	
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаписатьУдаление(Ссылка)
	
	МЗ = РегистрыСведений.DWH_ОбменСменыККМ.СоздатьМенеджерЗаписи();
	МЗ.СменаККМ = Ссылка;
	МЗ.Прочитать();
	МЗ.СменаККМ = Ссылка;
	МЗ.ДатаЗаписи = ТекущаяДата();
	МЗ.Индекс = МЗ.Индекс + 1;
	МЗ.Удаление = Истина;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаписатьУдалениеВДвижениях(Ссылка)
	
	МЗ = РегистрыСведений.DWH_ДатыДвиженийДокументов.СоздатьМенеджерЗаписи();
	МЗ.ДокументСсылка = Ссылка;
	МЗ.Прочитать();
	МЗ.Удаление = Истина;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура ЗафиксироватьИзменения(Ссылка, Объект, РежимЗаписи) Экспорт
	
	//ТипЗнчСсылка = ТипЗнч(Ссылка);
	
	//Если ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_СменаККМ") Тогда
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЗаписатьИзменение(Ссылка);	
	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры


Процедура DWH_Обмен_ПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
		
	ЗафиксироватьИзменения(Источник.Ссылка,Источник,РежимЗаписи);
	
КонецПроцедуры


Процедура DWH_Обмен_ПередУдалениемПередУдалением(Источник, Отказ) Экспорт
	
	ТипЗнчСсылка = ТипЗнч(Источник.Ссылка);
	Если ТипЗнчСсылка = Тип("ДокументСсылка.УЗ_СменаККМ") Тогда
		
		Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
			ЗаписатьУдаление(Источник.Ссылка);
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
			ЗаписатьУдалениеВДвижениях(Источник.Ссылка);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры


Процедура DWH_Обмен_ПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	ТипЗнчСсылка = ТипЗнч(Источник.Ссылка);
	ЗафиксироватьИзмененияВДвижениях(Источник.Ссылка,ТипЗнчСсылка);
	
КонецПроцедуры
